000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. add04.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500
000600 WORKING-STORAGE SECTION.
000700
000800 01  FIRST-NUMBER        PICTURE IS 99.
000900 01  SECOND-NUMBER       PICTURE IS 99.
001000 01  THE-RESULT          PICTURE IS 999.
001100
001200 PROCEDURE DIVISION.
001300
001400 PROGRAM-BEGIN.
001500     DISPLAY "This program will add 2 numbers.".
001600
001700 GET-FIRST-NUMBER.
001800     DISPLAY "Enter the first number.".
001900
002000     ACCEPT FIRST-NUMBER.
002100
002200 GET-SECOND-NUMBER.
002300     DISPLAY "Enter the second number.".
002400
002500     ACCEPT SECOND-NUMBER.
002600
002700 COMPUTE-AND-DISPLAY.
002800     COMPUTE THE-RESULT = FIRST-NUMBER + SECOND-NUMBER.
002900
003000     DISPLAY "The result is " THE-RESULT.
003100
003200
003300 PROGRAM-DONE.
003400     STOP RUN.
003500
