000100 IDENTIFICATION DIVISION.
000200 PROGRAM-ID. helohelo.
000300 ENVIRONMENT DIVISION.
000400 DATA DIVISION.
000500 PROCEDURE DIVISION.
000600 
000700 PROGRAM-BEGIN.
000800     DISPLAY "Hello, World!".
000900     DISPLAY "I said, Hello, World!".
001000
001100 PROGRAM-DONE.
001200     STOP RUN.
